# Python03.py

"""

    a. 리스트
        a = []
        b = [1,2,3]
        c = ['Life','is','too','short']
        d = [1,2,'Life','is']
        e = [1,2,['Life','is']]

    b. 리스트 인덱싱
        a = [1,2,3]
        a
        [1,2,3]

        a[0]
        1

        *list[-1] : 리스트의 마지막 요소값 

        a = [1,2,3,['a','b','c']]
        a[0] : 1
        a[-1] : ['a','b','c']
        a[3] : ['a','b','c']
        a[-1][0] : 'a'

    
    c. 리스트 슬라이싱
        a = [1,2,3,4,5]
        a[0:2]
        [1,2]

        a = [1,2,3,['a','b','c'],4,5]
        a[2:5] : [3,['a','b','c'],4]
        a[3][:2] : ['a','b']


    


"""